; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-23)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 p2 p3 p4 - package
    l1 l2 l3 l4 l5 l6 l7 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l6)
    (at p3 l1)
    (at p4 l2)
    (at v1 l3)
    (at v2 l6)
    (at v3 l7)
    (road l2 l4)
    (road l7 l1)
    (road l3 l4)
    (road l4 l3)
    (road l5 l4)
    (road l4 l6)
    (road l6 l4)
    (road l1 l4)
    (road l4 l2)
    (road l4 l5)
    (road l1 l7)
    (road l4 l1)
    (road l1 l5)
    (road l5 l1)
    (road l6 l7)
    (road l7 l6)
    (road l2 l5)
    (road l5 l2)
    (road l3 l7)
    (road l7 l3)
    (road l2 l7)
    (road l7 l2)
    )
 (:goal (and 
(at p4 l4)
))
)

; plan
1. (drive v3 l7 l2)
   deleted: (at v3 l7)
   added: (at v3 l2)
   goals met: 0 of 1
2. (pick-up v3 l2 p4 c1 c2)
   deleted: (at p4 l2) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 0 of 1
3. (drive v3 l2 l4)
   deleted: (at v3 l2)
   added: (at v3 l4)
   goals met: 0 of 1
4. (drop v3 l4 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l4) (capacity v3 c2)
   goals met: 1 of 1
